OpenNuvoton/M2351BSP/SampleCode/StdDriver/SC_EmulateCard/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V3.00
 * @brief    Emulate a smartcard and send ATR to card reader.
 *
  * @copyright (C) 2017 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"


#define PLL_CLOCK       64000000


#define DEF_DEBUG       0
#if (DEF_DEBUG == 1)
#define DbgPrintf   printf
#else
#define DbgPrintf(...)
#endif

/*
    Sample code Notes:
    1. Set smartcard transmit protocol.
        SEL_PROTOCOL_T
            (0UL): for emulate T=0 transmit protocol samrtcard
            (1UL): for emulate T=1 transmit protocol samrtcard
    2. Enable smartcard working frequency.
        SC_CLK_MODE_AUTO
            This mode is using TM2(PD.0) pin to calculate reader clock frequency in activation state.
            And smartcard will use this clock frequency to response ATR to reader.
        SC_CLK_MODE_x
            If this mode is selected, smartcard will use specify clock frequency(x) to response ATR to reader.
*/

/* Select card transmission protocol */
#define SEL_PROTOCOL_T          (0UL)


/* Select one of the below SC_CLK_MODE_ to set smartcard clock frequency */
//#define SC_CLK_MODE_AUTO    /* Get initial reader clock on TM2(PD.0) pin */
#if !defined(SC_CLK_MODE_AUTO)
// #define SC_CLK_MODE_3P58M      3580000
// #define SC_CLK_MODE_3P75M      3750000
#define SC_CLK_MODE_4M         4000000
// #define SC_CLK_MODE_4P8M       4800000
// #define SC_CLK_MODE_6M         6000000
#endif


#define CARD_CD                 PC12    /* [out] */
#define CARD_PWR                PB2     /* [in] */
#define CARD_RST                PB3     /* [in] */
#define CARD_DAT                PB4     /* [out/in] SC0_DAT pin */
#define CARD_CLK                PB5     /* [out] for debug ...*/


#define SC_INS_SELECT           0xA4
#define SC_INS_GET_RESPONSE     0xC0
#define SC_INS_GET_DATA         0xCA
#define SC_INS_0xCB             0xCB
#define SC_INS_READ_BINARY      0xB0
#define SC_INS_WRITE_BINARY     0xD6

#define ERR_INVALID_CMD         0x8888

/* Card operation state */
typedef enum
{
    SC_OP_IDLE = 0,
    SC_OP_WRITE,
    SC_OP_READ,
    SC_OP_WRITE_ATR,
    SC_OP_PPS_EXCHANGE,
    SC_OP_PPS_ERROR,
} E_SC_OP_STATE;


/* Card data structure */
typedef struct
{
    SC_T            *sc;

    uint8_t         u8Protocol;

    uint8_t         *pu8TxBuf;
    uint32_t        u32TxLen;
    uint32_t        u32TxPos;

    uint8_t         *pu8RxBuf;
    uint32_t        u32RxLen;
    uint32_t        u32RxPos;

    uint8_t         *pu8RespBuf;
    uint32_t        u32RespLen;

    volatile E_SC_OP_STATE  OP_State;

    volatile uint8_t        u8RestToATR;

    int32_t         i32CmdStatus;
} SC_INFO_T;


volatile SC_INFO_T g_sSCInfo;
volatile uint8_t g_au8SCTxBuf[300] = {0};
volatile uint8_t g_au8SCRxBuf[300] = {0};
volatile uint8_t g_au8CardATRBuf[48] = {0};


#if (SEL_PROTOCOL_T == 0UL)
const uint8_t g_au8CardATR_T0[] =
{
#if defined(DEF_ATR_WITH_PPS)
    0x3B,
    0x16,
    0x94,   /* With PPS exchange */
    /* Historical bytes, 6 */
    0x71, 0x01, 0x01, 0x06, 0x02, 0x00,
#else
    0x3B,
    0x17,
    0x11,   /* No PPS exchange */
    /* Historical bytes, 7 */
    0x89, 0x01, 0x02, 0x00, 0x00, 0x41, 0xC3,
#endif
};
#endif


#if (SEL_PROTOCOL_T == 1UL)
const uint8_t g_au8CardATR_T1[] =
{
    0x3B,
    0xF7,
    0x11,   /* No PPS exchange */
    0x00,
    0x00,
    0x81,
    0x71,
    0xFE,
    0x42,
    0x00,
    /* Historical bytes, 7 */
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    0x55, /* TCK */
};
#endif


/** Clock rate conversion table according to ISO */
typedef struct
{
    uint32_t u32F;
    uint32_t u32FS;
} CLOCK_RATE_CONVERSION;
/* Fi */
const CLOCK_RATE_CONVERSION g_ClockRateConversion[] =
{
    { 372,  4000000     },
    { 372,  5000000     },
    { 558,  6000000     },
    { 744,  8000000     },
    { 1116, 12000000    },
    { 1488, 16000000    },
    { 1860, 20000000    },
    { 0,    0           },
    { 0,    0           },
    { 512,  5000000     },
    { 768,  7500000     },
    { 1024, 10000000    },
    { 1536, 15000000    },
    { 2048, 20000000    },
    { 0,    0           },
    { 0,    0           }
};

/**
 * Bit rate adjustment factor
 * The layout of this table has been slightly modified due to
 * the unavailability of floating point math support in the kernel.
 * The value D has been divided into a numerator and a divisor.
 */
typedef struct
{
    uint32_t u32DNumerator;
    uint32_t u32DDivisor;
} BIT_RATE_ADJUSTMENT;
/* Di */
const BIT_RATE_ADJUSTMENT g_BitRateAdjustment[] =
{
    { 0,    0   },
    { 1,    1   },
    { 2,    1   },
    { 4,    1   },
    { 8,    1   },
    { 16,   1   },
    { 32,   1   },
    { 64,   1   },
    { 12,   1   },
    { 20,   1   },
    { 0,    0   },
    { 0,    0   },
    { 0,    0   },
    { 0,    0   },
    { 0,    0   },
    { 0,    0   }
};


void Init_CardInfo_And_CardPin(SC_INFO_T *sc_info, SC_T *sc, uint8_t u8Protocol)
{
    /* Card info. */
    {
        sc_info->sc         = sc;
        sc_info->u8Protocol = u8Protocol;

        sc_info->pu8TxBuf   = NULL;
        sc_info->u32TxLen   = 0;
        sc_info->u32TxPos   = 0;
        sc_info->pu8RxBuf   = NULL;
        sc_info->u32RxLen   = 0;
        sc_info->u32RxPos   = 0;
        sc_info->pu8RespBuf = NULL;
        sc_info->u32RespLen = 0;

        sc_info->OP_State = SC_OP_IDLE;

        sc_info->u8RestToATR = 0;

        sc_info->i32CmdStatus = -1;
    }

    /* Configure card pins */
    {
        SYS->GPB_MFPL &= ~(SC0_PWR_PB2_Msk | SC0_RST_PB3_Msk | SC0_CLK_PB5_Msk | SC0_DAT_PB4_Msk);
        SYS->GPB_MFPL |= (SC0_DAT_PB4);
        //SYS->GPB_MFPL |= (SC0_CLK_PB5); // for debug active CLK

        CARD_CD  = 1; // [out]
        CARD_PWR = 0; // [in]
        CARD_RST = 0; // [in]
        GPIO_SetMode(PC, BIT12, GPIO_MODE_OUTPUT);
        GPIO_SetMode(PB, BIT3, GPIO_MODE_INPUT);
        GPIO_SetMode(PB, BIT2, GPIO_MODE_INPUT);
    }

    /* Clear Rx/Tx buffer */
    memset((void *)g_au8SCRxBuf, 0x0, sizeof(g_au8SCRxBuf));
    memset((void *)g_au8SCTxBuf, 0x0, sizeof(g_au8SCRxBuf));
}


int32_t Card_AutoFreqCheck(void)
{
    uint32_t u32CAP, u32CardFreq;
    uint64_t u64WorkFreq;

    /* Set Timer0 event counting pin PD.0 */
    SYS->GPD_MFPL |= TM2_PD0;

    /* Enable TIMER peripheral clock */
    CLK_EnableModuleClock(TMR2_MODULE);
    CLK_EnableModuleClock(TMR3_MODULE);
    CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2SEL_PCLK1, 0);
    CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3SEL_PCLK1, 0);

    /* Give a dummy target frequency here. Will over write prescale and compare value with macro */
    TIMER_Open(TIMER2, TIMER_ONESHOT_MODE, 100);
    /* Update prescale and compare value. Calculate average frequency every 1000 events */
    TIMER_SET_PRESCALE_VALUE(TIMER2, 0);
    TIMER_SET_CMP_VALUE(TIMER2, 10000);
    /* Update Timer 1 prescale value. So Timer 0 clock is 12MHz */
    TIMER_SET_PRESCALE_VALUE(TIMER3, 0);
    TIMER_EnableFreqCounter(TIMER2, 0, 0, FALSE);
    while(TIMER_GetCaptureIntFlag(TIMER3) == 0) {}
    u32CAP = TIMER3->CAP;
    TIMER_ClearCaptureIntFlag(TIMER3);

