OpenNuvoton/M2351BSP/SampleCode/StdDriver/SC_EmulateCard/main.c
    u64WorkFreq = ((uint64_t)SystemCoreClock * (uint64_t)10000) / (uint64_t)(u32CAP);
    u64WorkFreq = (u64WorkFreq / 1000) * 1000;
    u32CardFreq = (uint32_t)u64WorkFreq;

    if((u32CardFreq >= 3000000) && (u32CardFreq <= 12000000))
    {
        CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_HIRC, CLK_CLKDIV0_HCLK(1UL));
        CLK_EnablePLL(CLK_PLLCTL_PLLSRC_HXT, (u32CardFreq * 10)); // set PLL from 30M to 120M
        if(u32CardFreq <= 4800000)
        {
            CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(1UL));
        }
        else if((u32CardFreq > 4800000) && (u32CardFreq <= 9600000))
        {
            CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(2UL));
        }
        else
        {
            CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(3UL));
        }
        CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PLL, CLK_CLKDIV1_SC0(10));

        DbgPrintf("F: %d.\n", u32CardFreq);
        return u32CardFreq;
    }
    else
    {
        DbgPrintf("F: X. (%d)\n", u32CardFreq);
        return -1;
    }
}


void Card_SetFreqAfterPPSExchange(uint32_t u32Fi, uint32_t u32Di)
{
    //SC_T *sc;
    //sc = g_sSCInfo.sc;
    //printf("ETUCTL: %d. (With PPS)\n", sc->ETUCTL);
    //printf("Fi:%d, Di:%d\n", Fi, Di);

    if(g_ClockRateConversion[u32Fi].u32FS != 0)
    {
        CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_HIRC, CLK_CLKDIV0_HCLK(1UL));
        CLK_EnablePLL(CLK_PLLCTL_PLLSRC_HXT, (g_ClockRateConversion[u32Fi].u32FS * 10));
        if(g_ClockRateConversion[u32Fi].u32FS <= 6000000)
        {
            CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(1UL));
        }
        else if(g_ClockRateConversion[u32Fi].u32FS >= 15000000)
        {
            CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(3UL));
        }
        else
        {
            CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(2UL));
        }
        CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PLL, CLK_CLKDIV1_SC0(10));
    }
}


int32_t Card_ResponseATR(SC_INFO_T *sc_info)
{
    uint8_t i;
    uint8_t u32Fi, u32Di, u32Len;
    uint8_t u8PCK = 0;
    SC_T *sc;

    sc = sc_info->sc;

    if(sc == SC0)
        NVIC_EnableIRQ(SC0_IRQn);
    else if(sc == SC1)
        NVIC_EnableIRQ(SC1_IRQn);
    else if(sc == SC2)
        NVIC_EnableIRQ(SC2_IRQn);
    else
        while(1) {}

#if (SEL_PROTOCOL_T == 0UL)
    if(sc_info->u8Protocol == 0)
    {
        u32Len = sizeof(g_au8CardATR_T0);
        memcpy((void *)g_au8CardATRBuf, g_au8CardATR_T0, u32Len);
    }
    else
    {
        printf("\nERROR. Unknow ptotocol.\n");
        while(1) {}
    }
#endif
#if (SEL_PROTOCOL_T == 1UL)
    if(sc_info->u8Protocol == 1)
    {
        u32Len = sizeof(g_au8CardATR_T1);
        memcpy((void *)g_au8CardATRBuf, g_au8CardATR_T1, u32Len);
    }
    else
    {
        printf("\nERROR. Unknow ptotocol.\n");
        while(1) {}
    }
#endif

    sc->CTL = SC_CTL_SCEN_Msk; /* Disable RX to receive data in initial state */
    sc->CTL |= (SC_CTL_RXOFF_Msk | SC_CTL_TXOFF_Msk);
    sc->ETUCTL = 0x173; // 372 * SC clocks
    sc->ALTCTL |= SC_ALTCTL_ACTEN_Msk;
    while((sc->INTSTS & SC_INTSTS_INITIF_Msk) != SC_INTSTS_INITIF_Msk);
    sc->INTSTS = SC_INTSTS_INITIF_Msk;

    sc->CTL &= ~SC_CTL_TXOFF_Msk;

    u32Fi = g_au8CardATRBuf[2] >> 4;
    u32Di = g_au8CardATRBuf[2] & 0xF;

    sc_info->OP_State = SC_OP_WRITE_ATR;
    sc_info->pu8TxBuf = (uint8_t *)&g_au8CardATRBuf[0];
    sc_info->u32TxLen = u32Len;
    sc_info->u32TxPos = 0;
    sc_info->pu8RxBuf = (uint8_t *)&g_au8SCRxBuf[0];
    sc_info->u32RxLen = 0;
    sc_info->u32RxPos = 0;
    /* Enable to send data in IRQ */
    SC_ENABLE_INT(sc, (SC_INTEN_TBEIEN_Msk | SC_INTEN_RDAIEN_Msk));
    while(sc_info->OP_State == SC_OP_WRITE_ATR) {}

    if(sc_info->OP_State == SC_OP_PPS_EXCHANGE)
    {
        /* Enable RX to receive data */
        sc->CTL &= ~SC_CTL_RXOFF_Msk;
        while(sc_info->OP_State == SC_OP_PPS_EXCHANGE) {}
        if(sc_info->OP_State == SC_OP_PPS_ERROR)
        {
            printf("ERROR. PPS EXCHANGE fail.\n");
            return -1;
        }
        sc->CTL |= SC_CTL_RXOFF_Msk; /* Disable RX to receive data */

        /* Calculate PCK of PPS */
        for(i = 0; i < (sc_info->u32RxLen - 1); i++)
            u8PCK ^= g_au8SCRxBuf[i];
        if(u8PCK != g_au8SCRxBuf[i])
        {
            printf("\nERROR. PPS checksum error.\n");
            return -1;
        }

        sc_info->OP_State = SC_OP_WRITE;
        sc_info->pu8TxBuf = (uint8_t *)&g_au8SCRxBuf[0];
        sc_info->u32TxLen = sc_info->u32RxLen;
        sc_info->u32TxPos = 0;
        /* Enable to send data in IRQ */
        SC_ENABLE_INT(sc, SC_INTEN_TBEIEN_Msk);
        while(sc_info->OP_State == SC_OP_WRITE) {}

        /* Update parameters */
        sc->ETUCTL = (g_ClockRateConversion[u32Fi].u32F / g_BitRateAdjustment[u32Di].u32DNumerator) - 1;

        Card_SetFreqAfterPPSExchange(u32Fi, u32Di);
    }
    else
    {
        ; // No PPS exchange
    }
    if(sc_info->u8Protocol == 0)
        SC_SetBlockGuardTime(sc, 16); // for T=0
    else
        SC_SetBlockGuardTime(sc, 22); // for T=1

    /* Set card in READ state */
    memset((void *)g_au8SCRxBuf, 0x0, sizeof(g_au8SCRxBuf));
    sc_info->OP_State = SC_OP_READ;
    sc_info->pu8TxBuf = (uint8_t *)&g_au8SCRxBuf[0];
    sc_info->u32TxLen = sizeof(g_au8SCRxBuf);
    sc_info->u32TxPos = 0;
    sc_info->pu8RxBuf = (uint8_t *)&g_au8SCRxBuf[0];
    sc_info->u32RxLen = 5;
    sc_info->u32RxPos = 0;
    sc_info->i32CmdStatus = -1;

    /* Enable RX to receive data */
    sc->CTL &= ~SC_CTL_RXOFF_Msk;

    return 0;
}


/* Return -1 means invalid command */
static int32_t Check_IsValidT0Cmd(SC_T *sc)
{
    //uint8_t u32CLA, u32INS, u32P1, u32P2, u32P3;
    uint8_t u32INS, u32P1, u32P2;

    //u32CLA  = g_sSCInfo.pu8RxBuf[0];
    u32INS  = g_sSCInfo.pu8RxBuf[1];
    u32P1   = g_sSCInfo.pu8RxBuf[2];
    u32P2   = g_sSCInfo.pu8RxBuf[3];
    //u32P3   = g_sSCInfo.pu8RxBuf[4];

    if((u32INS == SC_INS_SELECT) && (u32P1 == 0x0) && (u32P2 == 0x0))
    {
        /* Valid INS */
        SC_WRITE(sc, g_sSCInfo.pu8RxBuf[1]);
        g_sSCInfo.u32RxLen = 5 + g_sSCInfo.pu8RxBuf[4];
    }
    else if(u32INS == SC_INS_GET_RESPONSE)
    {
        /* Valid INS */
        SC_WRITE(sc, g_sSCInfo.pu8RxBuf[1]);
    }
    else
    {
        /* INS ... not supported */
        return -1;
    }

    return u32INS;
}


void ProcessIRQ_TxRx(SC_T *sc)
{
    uint32_t i;
    uint32_t u32Tmp;
    char c;

