OpenNuvoton/M2351BSP/SampleCode/StdDriver/SC_EmulateCard/main.c
    /* Transmit buffer empty interrupt */
    if(sc->INTSTS & SC_INTSTS_TBEIF_Msk)
    {
        if((g_sSCInfo.OP_State == SC_OP_WRITE) || (g_sSCInfo.OP_State == SC_OP_WRITE_ATR))
        {
            /* We can push 4 bytes into FIFO at most due to FIFO depth limitation */
            for(i = 0; i < 4; i++)
            {
                /* Wait Tx empty */
                while((sc->STATUS & SC_STATUS_TXEMPTY_Msk) == 0ul) {}
                u32Tmp = g_sSCInfo.u32TxPos;
                SC_WRITE(sc, g_sSCInfo.pu8TxBuf[u32Tmp]);
                g_sSCInfo.u32TxPos++;
                if(g_sSCInfo.u8RestToATR == 1)
                {
                    /* Wait reader check "TS" //CLK_SysTickDelay(80000) */
                    if(g_sSCInfo.u32TxPos == 1)
                    {
                        CLK_SysTickDelay(1000);
                    }
                }
                u32Tmp = g_sSCInfo.u32TxPos;
                if(u32Tmp == g_sSCInfo.u32TxLen)
                {
                    /* Wait all Tx transfer finished */
                    while((sc->STATUS & SC_STATUS_TXACT_Msk) == SC_STATUS_TXACT_Msk) {}
                    SC_DISABLE_INT(sc, SC_INTEN_TBEIEN_Msk);
                    if(g_sSCInfo.OP_State == SC_OP_WRITE_ATR)
                    {
                        if(((g_au8CardATRBuf[2] >> 4) > 1) || ((g_au8CardATRBuf[2] & 0xF) > 1)) // Fi, Di not default value
                        {
                            g_sSCInfo.OP_State = SC_OP_PPS_EXCHANGE;
                        }
                        else
                        {
                            g_sSCInfo.OP_State = SC_OP_IDLE;
                        }
                    }
                    else
                    {
                        g_sSCInfo.OP_State = SC_OP_IDLE;
                    }
                    break;
                }
            }
        }
    }

    if(sc->INTSTS & SC_INTSTS_RDAIF_Msk)
    {
        if(g_sSCInfo.OP_State == SC_OP_PPS_EXCHANGE)
        {
            c = SC_READ(sc);
            /* Total PPSS, PPS0, [PPS1/2/3], PCK */
            u32Tmp = g_sSCInfo.u32RxPos;
            g_sSCInfo.pu8RxBuf[u32Tmp] = c;
            g_sSCInfo.u32RxPos++;

            if(g_sSCInfo.u32RxPos <= 2) // for PPSS, PPS0
                g_sSCInfo.u32RxLen++;

            if(g_sSCInfo.pu8RxBuf[0] != 0xFF) // check PPSS
            {
                //printf("\nERROR. Wrong PPSS, 0x%x.\n", g_sSCInfo.pu8RxBuf[0]);
                g_sSCInfo.OP_State = SC_OP_PPS_ERROR;
            }
            if(g_sSCInfo.u32RxPos == 2) // get PPS0
            {
                if((g_sSCInfo.pu8RxBuf[1]&BIT4) == BIT4)
                    g_sSCInfo.u32RxLen++; // support PPS1
                if((g_sSCInfo.pu8RxBuf[1]&BIT5) == BIT5)
                    g_sSCInfo.u32RxLen++; // support PPS2
                if((g_sSCInfo.pu8RxBuf[1]&BIT6) == BIT6)
                    g_sSCInfo.u32RxLen++; // support PPS3

                /* Get max RX counts */
                g_sSCInfo.u32RxLen++; // PCK
            }
            u32Tmp = g_sSCInfo.u32RxPos;
            if((u32Tmp >= 2) && (u32Tmp == g_sSCInfo.u32RxLen))
            {
                g_sSCInfo.OP_State = SC_OP_IDLE;
            }
        }
        else if(g_sSCInfo.OP_State == SC_OP_READ)
        {
            if(g_sSCInfo.u8Protocol == 0UL)
            {
                c = SC_READ(sc);
                /* For T=0 transmission protocol */
                u32Tmp = g_sSCInfo.u32RxPos;
                g_sSCInfo.pu8RxBuf[u32Tmp] = c;
                g_sSCInfo.u32RxPos++;
                if(g_sSCInfo.u32RxPos == 5)
                {
                    /* if g_sSCInfo.u32TxLen = ERR_INVALID_CMD, means invalid command */
                    g_sSCInfo.i32CmdStatus = Check_IsValidT0Cmd(sc);
                }
                u32Tmp = g_sSCInfo.u32RxPos;
                if(u32Tmp == g_sSCInfo.u32RxLen)
                    g_sSCInfo.OP_State = SC_OP_IDLE;
            }
            else if(g_sSCInfo.u8Protocol == 1UL)
            {
                c = SC_READ(sc);
                /* For T=1 transmission protocol */
                u32Tmp = g_sSCInfo.u32RxPos;
                g_sSCInfo.pu8RxBuf[u32Tmp] = c;
                g_sSCInfo.u32RxPos++;
                if(g_sSCInfo.u32RxPos == 3) // received LEN
                {
                    g_sSCInfo.u32RxLen = 1 + 1 + 1 + g_sSCInfo.pu8RxBuf[2] + 1; /* NAD, PCB, LEN, [APDU], EDC */
                }
                u32Tmp = g_sSCInfo.u32RxPos;
                if(u32Tmp == g_sSCInfo.u32RxLen)
                    g_sSCInfo.OP_State = SC_OP_IDLE;
            }
            else
            {
                printf("Unknown protocol (%d)\n", g_sSCInfo.u8Protocol);

                sc->CTL |= (SC_CTL_RXOFF_Msk | SC_CTL_TXOFF_Msk);
                NVIC_DisableIRQ(SC0_IRQn);
                g_sSCInfo.OP_State = SC_OP_IDLE;
                g_sSCInfo.u8RestToATR = 0;
                //while(1) {}
            }
        }
        else
        {
            /* Discard these data */
            c = SC_READ(sc);
            printf("SC: Unknown data %02x (STATE:%d)\n", c, g_sSCInfo.OP_State);
            //sc->CTL |= (SC_CTL_RXOFF_Msk | SC_CTL_TXOFF_Msk);
            //NVIC_DisableIRQ(SC0_IRQn);
            //g_sSCInfo.OP_State = SC_OP_IDLE;
            //g_sSCInfo.u8RestToATR = 0;
        }
    }
}


#if (SEL_PROTOCOL_T == 0UL)

const uint8_t g_u8RespMF[] =
{
    0x00, 0x00, 0x00, 0x00, 0x7F,
    0x10, 0x02, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x0D, 0x13, 0x00,
    0x0A, 0x04, 0x00, 0x83, 0x8A,
    0x83, 0x8A, 0x00, 0x01, 0x00,
    0x00,
};

const uint8_t g_u8RespDF[] =
{
    0xDF, 0x0A, 0x11, 0x22, 0x33,
    0x44, 0x55, 0x66, 0x77, 0x88,
};

const uint8_t g_u8RespEF[] =
{
    0xEF, 0x12, 0x01, 0x02, 0x03,
    0x04, 0x05, 0x06, 0x07, 0x08,
    0x09, 0x0A, 0x0B, 0x0C, 0x0D,
    0x0E, 0x0F, 0x10,
};

int32_t Process_T0(SC_INFO_T *sc_info)
{
    SC_T *sc;
    uint8_t i;
    uint8_t u32SW1, u32SW2, u32RespLen;
    //uint8_t u8CLA, u8INS, u8P1, u8P2, u8P3, u8D[8];
    uint8_t u8INS, u8P1, u8P2, u8P3, u8D[8];

    sc = sc_info->sc;

    //u8CLA  = g_au8SCRxBuf[0];
    u8INS  = g_au8SCRxBuf[1];
    u8P1   = g_au8SCRxBuf[2];
    u8P2   = g_au8SCRxBuf[3];
    u8P3   = g_au8SCRxBuf[4];
    u8D[0] = g_au8SCRxBuf[5];
    u8D[1] = g_au8SCRxBuf[6];

    if(DEF_DEBUG) /* Enable for debug */
    {
        if(sc_info->u32TxLen == ERR_INVALID_CMD)
        {
            printf("\n---------> (%d) (Invalid)\n", (5));
            for(i = 0; i < (5); i++)
                printf("   0x%02x\n", g_au8SCRxBuf[i]);
            printf("---------\n");
        }
        else
        {
            printf("\n---------> (%d)\n", (5 + u8P3));
            for(i = 0; i < (5 + u8P3); i++)
                printf("   0x%02x\n", g_au8SCRxBuf[i]);
            printf("---------\n");
        }
    }

    do
    {
        /* Check if valid cmd exist or not */
        if(sc_info->i32CmdStatus == -1)
        {
            //// "Instruction not supported"
            //u32SW1 = 0x6D;
            //u32SW2 = 0x00;
            //// "Function not supported"
            //u32SW1 = 0x6A;
            //u32SW2 = 0x81;
            //// "File not found"
            //u32SW1 = 0x6A;
            //u32SW2 = 0x82;
            u32SW1 = 0x6D;
            u32SW2 = 0x00;

            sc_info->OP_State = SC_OP_WRITE;
            sc_info->pu8TxBuf = (uint8_t *)&g_au8SCTxBuf[0];
            sc_info->u32TxLen = 2;
            sc_info->u32TxPos = 0;

            g_au8SCTxBuf[0] = u32SW1;
            g_au8SCTxBuf[1] = u32SW2;
            break;
        }

        /* Check INS */
        switch(u8INS)
        {
            case SC_INS_SELECT: // INS: SELECT FILE
                if((u8P1 != u8P2) || (u8P1 != 0x0) || (u8P3 != 0x2))
                {
                    sc_info->u32RxPos = sc_info->u32RxLen = 0;
                    printf("\nERROR. SELECT FILE, APDU data.\n");
                    return -1;
                }
                u32SW1 = 0x9F;
                /* Prepare response data and length */
                if((u8D[0] == 0x3F) && (u8D[1] == 0x00))        /* MF */
                {
                    sc_info->pu8RespBuf = (uint8_t *)&g_u8RespMF[0];
                    sc_info->u32RespLen = sizeof(g_u8RespMF);
                }
                else if((u8D[0] == 0x7F) && (u8D[1] == 0x10))   /* DF */
                {
                    sc_info->pu8RespBuf = (uint8_t *)&g_u8RespDF[0];
                    sc_info->u32RespLen = sizeof(g_u8RespDF);
                }
                else if((u8D[0] == 0x6F) && (u8D[1] == 0x3A))   /* EF */
                {
                    sc_info->pu8RespBuf = (uint8_t *)&g_u8RespEF[0];
                    sc_info->u32RespLen = sizeof(g_u8RespEF);
                }
                else
                {
                    sc_info->u32RxPos = sc_info->u32RxLen = 0;
                    printf("\nERROR. SELECT FILE, directory.\n");
                    return -1;
                }
                u32SW2 = sc_info->u32RespLen;

                sc_info->OP_State = SC_OP_WRITE;
                sc_info->pu8TxBuf = (uint8_t *)&g_au8SCTxBuf[0];
                sc_info->u32TxLen = 2;
                sc_info->u32TxPos = 0;

                g_au8SCTxBuf[0] = u32SW1;
                g_au8SCTxBuf[1] = u32SW2;
                break;

            case SC_INS_GET_DATA: // INS: GET DATA
                u32SW1 = 0x90;
                u32SW2 = 0x00;

                sc_info->OP_State = SC_OP_WRITE;
                sc_info->pu8TxBuf = (uint8_t *)&g_au8SCTxBuf[0];
                sc_info->u32TxLen = 2;
                sc_info->u32TxPos = 0;

                g_au8SCTxBuf[0] = u32SW1;
                g_au8SCTxBuf[1] = u32SW2;
                break;

            case SC_INS_GET_RESPONSE: // INS: GET RESPONSE
                if((u8P1 != u8P2) || (u8P1 != 0x0) || (u8P3 == 0x0))
                {
                    u32RespLen = sc_info->u32RespLen = 0;
                    sc_info->u32RxPos = sc_info->u32RxLen = 0;
                    printf("\nERROR. 0x%x cmd data.\n", u8INS);
                    return -1;
                }
                if(sc_info->u32RespLen == 0)
                {
                    u32RespLen = sc_info->u32RespLen = 0;
                    u32SW1 = 0x94; /* No "EF" selected */
                    u32SW2 = 0x00;
                }
                else if(sc_info->u32RespLen < u8P3)
                {
                    u32RespLen = sc_info->u32RespLen = 0;
                    u32SW1 = 0x94; /* Over the selected size */
                    u32SW2 = 0x02;
                }
                else
                {
                    u32RespLen = u8P3;
                    u32SW1 = 0x90; /* Success */
                    u32SW2 = 0x00;
                }

