OpenNuvoton/M2351BSP/SampleCode/StdDriver/SC_EmulateCard/main.c
                /* Data: [Data] + SW1 + SW2 */
                memcpy((void *)(g_au8SCTxBuf), sc_info->pu8RespBuf, u32RespLen);
                g_au8SCTxBuf[u32RespLen + 0] = u32SW1;
                g_au8SCTxBuf[u32RespLen + 1] = u32SW2;

                sc_info->OP_State = SC_OP_WRITE;
                sc_info->pu8TxBuf = (uint8_t *)&g_au8SCTxBuf[0];
                sc_info->u32TxLen = u32RespLen + 2;
                sc_info->u32TxPos = 0;
                break;

            default:
                sc_info->u32RxPos = sc_info->u32RxLen = 0;
                printf("\nERROR. T=0. Wrong INS (0x%x).\n", u8INS);
                return -1;
        }
    }
    while(0);

    printf("Receive T=0 INS: 0x%02x, D0/1: 0x%02x/0x%02x. Response SW1/SW2: 0x%02x/0x%02x.\n", u8INS, u8D[0], u8D[1], u32SW1, u32SW2);

    /* Enable to send data in IRQ */
    SC_ENABLE_INT(sc, SC_INTEN_TBEIEN_Msk);
    while(sc_info->OP_State == SC_OP_WRITE) {}

    return 0;
}

#endif /* End of SEL_PROTOCOL_T == 0UL */


#if (SEL_PROTOCOL_T == 1UL)

#define SC_T1_BLOCK_S_IFS_REQ       (0xC1UL)
#define SC_T1_BLOCK_S_IFS_RES       (0xE1UL)
#define SC_T1_BLOCK_I               (0x00UL)
#define SC_T1_BLOCK_R               (0x80UL)
#define SC_T1_BLOCK_S               (0xC0UL)


/* Example:
    00A40000023F00      ... SELECT
    00B0000007          ... READ 7 bytes
    00D6000003112233    ... WRITE 3 bytes, 11 22 33
*/
static int32_t Check_IsValidT1Cmd(void)
{
    //uint8_t u8NAD, u8PCB, u8LEN;
    //uint8_t u8CLA, u8INS, u8P1, u8P2, u8P3;
    uint8_t u8INS, u8P1, u8P2;

    //u8NAD = g_au8SCRxBuf[0];
    //u8PCB = g_au8SCRxBuf[1];
    //u8LEN = g_au8SCRxBuf[2];
    //u8CLA = g_au8SCRxBuf[3];
    u8INS = g_au8SCRxBuf[4];
    u8P1  = g_au8SCRxBuf[5];
    u8P2  = g_au8SCRxBuf[6];
    //u8P3  = g_au8SCRxBuf[7];

    if((u8INS == SC_INS_SELECT) && (u8P1 == 0x0) && (u8P2 == 0x0))
    {
        return SC_INS_SELECT;
    }
    else if(u8INS == SC_INS_READ_BINARY)
    {
        return SC_INS_SELECT;
    }
    else if(u8INS == SC_INS_WRITE_BINARY)
    {
        return SC_INS_SELECT;
    }
    else
    {
        return -1;
    }
}


volatile uint32_t g_u32FileID = 0;
volatile uint32_t g_u32MaxFileSize = 0;
volatile uint8_t g_au8FileBuf[256];
int32_t Process_T1(SC_INFO_T *sc_info)
{
    SC_T *sc;
    uint32_t u32RxLen, u32TxLen;
    //uint8_t u8NAD, u8PCB, u8LEN, u8CLA, u8INS, u8EDC = 0;
    uint8_t u8PCB, u8INS, u8EDC = 0;
    uint8_t u8Data, u8RespIFLen, u8InDataLen;
    uint8_t *pu8RxBuf, *pu8TxBuf;
    uint8_t i;

    sc = sc_info->sc;
    u32RxLen = sc_info->u32RxLen;
    pu8RxBuf = (uint8_t *)&g_au8SCRxBuf[0];
    pu8TxBuf = (uint8_t *)&g_au8SCTxBuf[0];

    //u8NAD = g_au8SCRxBuf[0];
    u8PCB = g_au8SCRxBuf[1];
    //u8LEN = g_au8SCRxBuf[2];
    //u8CLA = g_au8SCRxBuf[3];
    u8INS = g_au8SCRxBuf[4];
    u8EDC = g_au8SCRxBuf[u32RxLen - 1];

    /* Calculate and check received EDC */
    u8Data = 0;
    for(i = 0; i < (u32RxLen - 1); i++)
        u8Data ^= g_au8SCRxBuf[i];
    if(u8EDC != u8Data)
    {
        sc_info->u32RxPos = sc_info->u32RxLen = 0;
        printf("\nERROR. Wrong EDC. (0x%x)\n", u8Data);
        return -1;
    }

    if(DEF_DEBUG) /* Enable for debug */
    {
        printf("\n---------> (%d)\n", u32RxLen);
        for(i = 0; i < u32RxLen; i++)
            printf("   0x%02x\n", g_au8SCRxBuf[i]);
        printf("---------<\n");
    }

    do
    {
        /* Process IFS_REQ */
        if(u8PCB == SC_T1_BLOCK_S_IFS_REQ)
        {
            u32TxLen = u32RxLen;

            g_u32MaxFileSize = g_au8SCRxBuf[3];

            /* Set default buffer data */
            for(i = 0; i < g_u32MaxFileSize; i++)
                g_au8FileBuf[i] = 0xA0 + i;

            /* Prepare response data to reader */
            memcpy((void *)(g_au8SCTxBuf), (void *)(g_au8SCRxBuf), u32TxLen);
            /* u8PCB */
            g_au8SCTxBuf[1] = SC_T1_BLOCK_S_IFS_RES;
            /* Calculate EDC */
            g_au8SCTxBuf[u32TxLen - 1] = 0x0;
            for(i = 0; i < (u32TxLen - 1); i++)
                g_au8SCTxBuf[u32TxLen - 1] ^= pu8TxBuf[i];
            printf("    [T=1 IFS_REQ. PCB: 0x%02x. Response EDC: 0x%02x.]\n", u8PCB, g_au8SCTxBuf[u32TxLen - 1]);
            break;
        }

        /* Check if valid cmd exist or not */
        g_sSCInfo.i32CmdStatus = Check_IsValidT1Cmd();
        if(g_sSCInfo.i32CmdStatus < 0)
        {
            u8RespIFLen = 2; /* "SW1-SW0" */

            u32TxLen = 1 + 1 + 1 + u8RespIFLen + 1; /* NAD, PCB, LEN, [IF], EDC */

            /* SW1-SW0 */
            g_au8SCTxBuf[u32TxLen - 3] = 0x6D;
            g_au8SCTxBuf[u32TxLen - 2] = 0x00;

            /* NAD, PCB */
            memcpy((void *)(g_au8SCTxBuf), (void *)(g_au8SCRxBuf), 2);
            /* LEN */
            g_au8SCTxBuf[2] = u8RespIFLen;
            /* INFO FIELD */
            memcpy((void *)&g_au8SCTxBuf[3], (void *)(g_au8FileBuf), u8RespIFLen - 2);
            /* Calculate EDC */
            g_au8SCTxBuf[u32TxLen - 1] = 0x0;
            for(i = 0; i < (u32TxLen - 1); i++)
                g_au8SCTxBuf[u32TxLen - 1] ^= pu8TxBuf[i];
            break;
        }

        /* Check [INS] to parse received TPDU */
        switch(u8INS)
        {
            case SC_INS_SELECT: // SELECT FILE
                /* Get FILE ID */
                g_u32FileID = (pu8RxBuf[8] << 8) | pu8RxBuf[9];

                u8RespIFLen = 2; /* "SW1-SW0" */

                u32TxLen = 1 + 1 + 1 + u8RespIFLen + 1; /* NAD, PCB, LEN, [IF], EDC */

                /* SW1-SW0 */
                g_au8SCTxBuf[u32TxLen - 3] = 0x90;
                g_au8SCTxBuf[u32TxLen - 2] = 0x00;
                break;

            case SC_INS_READ_BINARY: // READ BINARY
                if(g_u32MaxFileSize == 0)
                {
                    sc_info->u32RxPos = sc_info->u32RxLen = 0;
                    printf("Invalid File Size: 0x%x.\n", g_u32MaxFileSize);
                    return -1;
                }

                u8RespIFLen = g_au8SCRxBuf[7] + 2; /* Response data + "SW1-SW0" */

                u32TxLen = 1 + 1 + 1 + u8RespIFLen + 1; /* NAD, PCB, LEN, [IF], EDC */

                /* SW1-SW0 */
                g_au8SCTxBuf[u32TxLen - 3] = 0x90;
                g_au8SCTxBuf[u32TxLen - 2] = 0x00;
                break;

            case SC_INS_WRITE_BINARY: // WRITE BINARY
                if(g_u32MaxFileSize == 0)
                {
                    sc_info->u32RxPos = sc_info->u32RxLen = 0;
                    printf("Invalid File Size: 0x%x.\n", g_u32MaxFileSize);
                    return -1;
                }

                /* Update data to buffer */
                u8InDataLen = g_au8SCRxBuf[7]; /* Write-in data length */
                memcpy((void *)(g_au8FileBuf), (void *)(g_au8SCRxBuf + 8), u8InDataLen);

                u8RespIFLen = 2; /* "SW1-SW0" */

                u32TxLen = 1 + 1 + 1 + u8RespIFLen + 1; /* NAD, PCB, LEN, [IF], EDC */

                /* SW1-SW0 */
                g_au8SCTxBuf[u32TxLen - 3] = 0x90;
                g_au8SCTxBuf[u32TxLen - 2] = 0x00;
                break;
        }

        /* NAD, PCB */
        memcpy((void *)(g_au8SCTxBuf), (void *)(g_au8SCRxBuf), 2);
        /* LEN */
        g_au8SCTxBuf[2] = u8RespIFLen;
        /* INFO FIELD */
        memcpy((void *)&g_au8SCTxBuf[3], (void *)(g_au8FileBuf), u8RespIFLen - 2);
        /* Calculate EDC */
        g_au8SCTxBuf[u32TxLen - 1] = 0x0;
        for(i = 0; i < (u32TxLen - 1); i++)
            g_au8SCTxBuf[u32TxLen - 1] ^= pu8TxBuf[i];
    }
    while(0);

    if(DEF_DEBUG) /* Enable for debug */
    {
        printf("Tx data...\n");
        for(i = 0; i < u32TxLen; i++)
            printf("   %0d: 0x%02x\n", i, g_au8SCTxBuf[i]);
    }

    sc_info->OP_State = SC_OP_WRITE;
    sc_info->pu8TxBuf = (uint8_t *)&g_au8SCTxBuf[0];
    sc_info->u32TxLen = u32TxLen;
    sc_info->u32TxPos = 0;

    /* Enable to send data in IRQ */
    SC_ENABLE_INT(sc, SC_INTEN_TBEIEN_Msk);
    while(sc_info->OP_State == SC_OP_WRITE) {}

    printf("Receive T=1 INS: 0x%02x. Response EDC: 0x%02x.\n", u8INS, g_au8SCTxBuf[u32TxLen - 1]);
    return 0;
}

#endif /* End of SEL_PROTOCOL_T == 1UL */


void SC0_IRQHandler(void)
{
    ProcessIRQ_TxRx(SC0);
}


void GPB_IRQHandler(void)
{
    /* Get RST_PIN high */
    if(GPIO_GET_INT_FLAG(PB, BIT3))
    {
        GPIO_CLR_INT_FLAG(PB, BIT3);
        if(CARD_PWR == 1)
        {
            g_sSCInfo.u8RestToATR = 1;
        }
    }
}

void Card_SetFreqForATR(void)
{
#if defined(SC_CLK_MODE_AUTO)
    CLK_SetCoreClock(PLL_CLOCK);
    CLK_EnableModuleClock(SC0_MODULE);
    CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PCLK0, CLK_CLKDIV1_SC0(10));
#elif defined(SC_CLK_MODE_3P58M)
    CLK_SetCoreClock(SC_CLK_MODE_3P58M * 10);
    CLK_EnableModuleClock(SC0_MODULE);
    CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PCLK0, CLK_CLKDIV1_SC0(10));
#elif defined(SC_CLK_MODE_3P75M)
    CLK_SetCoreClock(SC_CLK_MODE_3P75M * 10);
    CLK_EnableModuleClock(SC0_MODULE);
    CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PCLK0, CLK_CLKDIV1_SC0(10));
#elif defined(SC_CLK_MODE_4M)
    CLK_SetCoreClock(SC_CLK_MODE_4M * 10);
    CLK_EnableModuleClock(SC0_MODULE);
    CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PCLK0, CLK_CLKDIV1_SC0(10));
#elif defined(SC_CLK_MODE_4P8M)
    CLK_SetCoreClock(SC_CLK_MODE_4P8M * 10);
    CLK_EnableModuleClock(SC0_MODULE);
    CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PCLK0, CLK_CLKDIV1_SC0(10));
#elif defined(SC_CLK_MODE_6M)
    CLK_SetCoreClock(SC_CLK_MODE_6M * 8);
    CLK_EnableModuleClock(SC0_MODULE);
    CLK_SetModuleClock(SC0_MODULE, CLK_CLKSEL3_SC0SEL_PCLK0, CLK_CLKDIV1_SC0(8));
#else
    -- - Without SC_CLK_SEL_xxx -- -
#endif
}

void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Enable HIRC clock */
    CLK_EnableXtalRC(CLK_PWRCTL_HIRCEN_Msk);

    /* Waiting for HIRC clock ready */
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

    /* Switch HCLK clock source to HIRC */
    CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_HIRC, CLK_CLKDIV0_HCLK(1));

    /* Enable HXT */
    CLK_EnableXtalRC(CLK_PWRCTL_HXTEN_Msk);

    /* Waiting for clock ready */
    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

    /* Enable PLL */
    CLK->PLLCTL = CLK_PLLCTL_128MHz_HIRC;

    /* Waiting for PLL stable */
    CLK_WaitClockReady(CLK_STATUS_PLLSTB_Msk);

    /* Select HCLK clock source as PLL and HCLK source divider as 2 */
    CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL, CLK_CLKDIV0_HCLK(2));

    /* Set SysTick source to HCLK/2 */
    CLK_SetSysTickClockSrc(CLK_CLKSEL0_STCLKSEL_HCLK_DIV2);

    /* Enable UART module clock */
    CLK_EnableModuleClock(UART0_MODULE);
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART0SEL_HIRC, CLK_CLKDIV0_UART0(1));

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set multi-function pins for UART0 RXD and TXD */
    SYS->GPB_MFPH = (SYS->GPB_MFPH & (~(UART0_RXD_PB12_Msk | UART0_TXD_PB13_Msk))) | UART0_RXD_PB12 | UART0_TXD_PB13;
}

void UART_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init UART                                                                                               */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Reset UART module */
    SYS_ResetModule(UART0_RST);

    /* Configure UART and set UART Baudrate */
    UART_Open(DEBUG_PORT, 115200);
}

/*---------------------------------------------------------------------------------------------------------*/
/*  MAIN function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{
    SC_T *sc;

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, peripheral clock and multi-function I/O */
    SYS_Init();

#if (DEF_DEBUG == 1)
    /* Debug I/O */
    PB->MODE = (PB->MODE & ~GPIO_MODE_MODE15_Msk) | (1 << GPIO_MODE_MODE15_Pos);
    PB15 = 1;
#endif

