OpenNuvoton/M2351BSP/SampleCode/StdDriver/SC_EmulateCard/main.c
    /* Init UART for printf */
    UART_Init();

    /* Init card info and I/O pins */
    Init_CardInfo_And_CardPin((SC_INFO_T *)&g_sSCInfo, SC0, SEL_PROTOCOL_T);

    printf("\n\nCPU @ %dHz \n", SystemCoreClock);
    printf("+--------------------------------------------+\n");
    printf("|    Emulate SC0 interface as a Smartcard    |\n");
    printf("+--------------------------------------------+\n");
    printf("# Smartcard I/O configuration:\n");
    printf("    SC0PWR (PB.2)  <--  input from READER_PWR pin\n");
    printf("    SC0RST (PB.3)  <--  input from READER_RST pin\n");
    printf("    SC0DAT (PB.4)  <--> connect with READER_DAT pin\n");
    printf("    SC0CD  (PC.12) -->  output to READER_CD pin\n");
#if defined(SC_CLK_MODE_AUTO)
    printf("    TM2    (PD.0) <--  input from READER_CLK pin to calculate clock frequency.\n");
#endif
    printf("\n\n");

    Card_SetFreqForATR();

    printf("Trigger CD_INSERT event.\n\n");
    CARD_CD = 0; /* Trigger reader active... */

    sc = g_sSCInfo.sc;
    sc->CTL = SC_CTL_SCEN_Msk; /* Disable RX to receive data in initial state */
    sc->CTL |= (SC_CTL_RXOFF_Msk | SC_CTL_TXOFF_Msk);
    sc->ETUCTL = 0x173; // 372 * SC clocks
    sc->ALTCTL |= SC_ALTCTL_ACTEN_Msk;
    while((sc->INTSTS & SC_INTSTS_INITIF_Msk) != SC_INTSTS_INITIF_Msk);
    sc->INTSTS = SC_INTSTS_INITIF_Msk;
#if (DEF_DEBUG == 1)
    PB15 = 0;
#endif

    /* Enable CARD_RST rising interrupt event */
    GPIO_EnableInt(PB, 3, GPIO_INT_RISING);
    NVIC_EnableIRQ(GPB_IRQn);

    while(1)
    {
        if(g_sSCInfo.u8RestToATR == 1)
        {
#if (DEF_DEBUG == 1)
            PB15 ^= 1;
#endif
#if defined(SC_CLK_MODE_AUTO)
            if(Card_AutoFreqCheck() > 0) // 1. Get valid reader clock. 2. Adjust card working frequency
            {
                if(Card_ResponseATR((SC_INFO_T *)&g_sSCInfo) < 0)
                {
                    g_sSCInfo.u8RestToATR = 0;
                    printf("[FAIL. Send ATR. (A)]\n\n");
                }
                else
                {
                    g_sSCInfo.u8RestToATR = 0x5A;
                    printf("[PASS. Send ATR. (A)]\n\n");
                }
            }
#else
            Card_SetFreqForATR();
            if(Card_ResponseATR((SC_INFO_T *)&g_sSCInfo) < 0)
            {
                g_sSCInfo.u8RestToATR = 0;
                printf("[FAIL. Send ATR. (M)]\n\n");
            }
            else
            {
                g_sSCInfo.u8RestToATR = 0x5A;
                printf("[PASS. Send ATR. (M)]\n\n");
            }
#endif
        }

        if(g_sSCInfo.u8RestToATR == 0x5A)
        {
            /* Process received data */
            /* Process cmd&&data from reader, then change OP_State to SC_OP_IDLE */
            while((g_sSCInfo.OP_State == SC_OP_READ) && (g_sSCInfo.u8RestToATR == 0x5A)) {}

            if(g_sSCInfo.u8RestToATR == 1)
                continue; /* Got RST event again. Send ATR to reader */

#if (SEL_PROTOCOL_T == 0UL)
            if(g_sSCInfo.u8Protocol == 0)
            {
                if(Process_T0((SC_INFO_T *)&g_sSCInfo) < 0)
                {
                    sc->CTL |= (SC_CTL_RXOFF_Msk | SC_CTL_TXOFF_Msk);
                    g_sSCInfo.OP_State = SC_OP_IDLE;
                    g_sSCInfo.u8RestToATR = 0;
                    printf("\nERROR. Process T0.\n");
                    continue;
                }
            }
#endif
#if (SEL_PROTOCOL_T == 1UL)
            if(g_sSCInfo.u8Protocol == 1)
            {
                if(Process_T1((SC_INFO_T *)&g_sSCInfo) < 0)
                {
                    sc->CTL |= (SC_CTL_RXOFF_Msk | SC_CTL_TXOFF_Msk);
                    g_sSCInfo.OP_State = SC_OP_IDLE;
                    g_sSCInfo.u8RestToATR = 0;
                    printf("\nERROR. Process T1.\n");
                    continue;
                }
            }
#endif

            /* Set in READ state */
            memset((void *)g_au8SCRxBuf, 0x0, sizeof(g_au8SCRxBuf));
            g_sSCInfo.OP_State = SC_OP_READ;
            g_sSCInfo.pu8TxBuf = (uint8_t *)&g_au8SCRxBuf[0];
            g_sSCInfo.u32TxLen = sizeof(g_au8SCRxBuf);
            g_sSCInfo.u32TxPos = 0;
            g_sSCInfo.pu8RxBuf = (uint8_t *)&g_au8SCRxBuf[0];
            g_sSCInfo.u32RxLen = 5;
            g_sSCInfo.u32RxPos = 0;
            g_sSCInfo.i32CmdStatus = -1;
        }
    }
}

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/
